//#####################################################################################
//	Файл				Display.cpp
//	Название:		Отображение меню.
//	Автор:			Бабкин.П.А
//	Вер. | гггг-ммм-дд | Внес изменения | Описание изменений
//	=====|=============|================|==============================================
// 	 1.0 | 2015 май 20 | Бабкин П.А	 		| Первый релиз
// 	-----|-------------|----------------|----------------------------------------------
//#####################################################################################


//#include "stm32f10x.h"
#include "__Display.hpp"
//#include "_Parameters.h"

using namespace src;


