//#####################################################################################
//	Файл				RC.cpp
//	Название:		Обработка ПДУ.
//	Автор:			Бабкин.П.А
//	Вер. | гггг-ммм-дд |     	Кто		 		| Описание изменений
//	=====|=============|================|==============================================
// 	 1.0 | 2015 июнь 4 | Бабкин П.А	 		| Первый релиз
// 	-----|-------------|----------------|----------------------------------------------
//#####################################################################################

#include "__RC.hpp"
#include "stdint.h"
#include "..\_Objects_Definitions\__ObjectsDefinitions.hpp"
#include "..\_Interfaces\__IControlCommands.hpp"



using namespace src;

//-------------------------------------------------------------------------------------
// Отработчик команд ПДУ. Вызывается периодически (500 млс)
// Пересылает принятые команды в контроллер меню
//-------------------------------------------------------------------------------------
void Rc::handler (void)
{
  if (getCommand()){
    switch (getCommand()){
      case 1: { _mainMenu->rcClear(); }break;
      case 2: { _mainMenu->rcOpen(); }break;
      case 3: { _mainMenu->rcClose(); }break;
      case 4: { _mainMenu->rcPlus(); }break;
      case 5: { _mainMenu->rcDown(); }break;
      case 6: { _mainMenu->rcRight(); }break;
      case 7: { _mainMenu->rcMinus(); }break;
      case 8: { _mainMenu->rcEnter(); }break;
    }
    clrCommand();
  }
    
}
//-------------------------------------------------------------------------------------

