//#####################################################################################
//	Файл				_AnalogSensors.cpp
//	Название:		Аналоговые датчики.
//	Автор:			Бабкин.П.А
//	Вер. | гггг-ммм-дд | Внес изменения | Описание изменений
//	=====|=============|================|==============================================
// 	 1.0 | 2015 апр 21 | Бабкин П.А	 		| Первый релиз
// 	-----|-------------|----------------|----------------------------------------------
//#####################################################################################

#include "__AnalogSensors.hpp"
//#include "stm32f10x.h"

namespace src{


//======================================================================================================================== 
// Class AnalogDcRmsSensor
//======================================================================================================================== 
 
// Конструктор с параметрами
AnalogDcRmsSensor::AnalogDcRmsSensor (float tsRms, float tfRms, IVariable* codeUcal, IVariable* codeZero, IVariable* uCal)
{
	_codeUcal   = codeUcal;
  _codeZero  = codeZero;
  _uCal       = uCal;
//  _meanFilter.putTsTf		(tsMean, tfMean);
	_rmsFilter.putTsTf		(tsRms, tfRms);
}

//======================================================================================================================== 
// Class AnalogMeanSensor
//======================================================================================================================== 
 
// Конструктор без параметров. Устанавливаются значения по умолчанию ts = 200mks, tf = 0.1sec
AnalogMeanSensor::AnalogMeanSensor()
 {
	putTsTf	(0.0002, 0.1);
 }


// Конструктор с параметрами
AnalogMeanSensor::AnalogMeanSensor (float tsMean, float tfMean)// : AnalogSensor(ts, tf)
{
	putTsTf		(tsMean, tfMean);
}


}

