//#####################################################################################
//	Файл				Filters.cpp
//	Название:		Цифровые фильтры.
//	Автор:			Бабкин.П.А
//	Вер. | гггг-ммм-дд | Внес изменения | Описание изменений
//	=====|=============|================|==============================================
// 	 1.0 | 2015 апр 21 | Бабкин П.А	 		| Первый релиз
// 	-----|-------------|----------------|----------------------------------------------
//#####################################################################################

#include "__Filters.hpp"

using namespace src;

//-------------------------------------------------------------------------------------------------------------------
// Inline методы описаны непосредственно в заголовочном файле
//-------------------------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------------------------
//	PutTsTf		- Установить период дискретизации (ts) и постоянную времени фильтра (tf). ts и tf задаются в секундах (0.0002 сек и тп)
//-------------------------------------------------------------------------------------------------------------------
void MeanFilter::putTsTf		(float ts, float tf)
{
	_ts = ts;
	//_tfm=2*Ts/Tf - Перерасчет Tf в величину _tfm, используемую в фильтре с целью сократить дополнительные расчеты
	_tfm = (2*ts)/tf;
}


