//#####################################################################################
//	Файл				__IDisplayed.h
//	Название:		Интерфейс работы с дисплеем
//	Автор:			Бабкин.П.А
//	Вер. | гггг-ммм-дд | Внес изменения | Описание изменений
//	=====|=============|================|==============================================
// 	 1.0 | 2015 май 20 | Бабкин П.А	 		| Первый релиз
// 	-----|-------------|----------------|----------------------------------------------
//#####################################################################################

#ifndef IDISPLAYED_HPP
#define IDISPLAYED_HPP

#include "stdint.h"
#include "string"

//#ifdef __cplusplus
// extern "C" {
//#endif 

using namespace std;
   
namespace src{	    

//=====================================================================================
//  Интерфейс работы с дисплеем.
//  Это свойство наследует и реализует класс, где требуется отображение
//=====================================================================================
class IDisplayed{
  public:
    virtual void getString (string& str, uint16_t row)=0;
    virtual void getRow (uint16_t& row)=0;
};

}	// namespace src


//#ifdef __cplusplus
//}
//#endif
#endif

