//#####################################################################################
//	Файл				IObservable.h
//	Название:		Интерфейс класса, обслуживающего наблюдателей
//	Автор:			Бабкин.П.А
//	Вер. | гггг-ммм-дд | Внес изменения | Описание изменений
//	=====|=============|================|==============================================
// 	 1.0 | 2015 июнь 3 | Бабкин П.А	 		| Первый релиз
// 	-----|-------------|----------------|----------------------------------------------
//#####################################################################################

#ifndef IOBSERVABLE_HPP
#define IOBSERVABLE_HPP

#ifdef __cplusplus
 extern "C" {
#endif 

namespace src{	 

//------------------------------------------------------------------------------------
//  Интерфейс наблюдателя
//------------------------------------------------------------------------------------
class IObserver{
  public:
    virtual void  handleEvent (void) {}
    virtual void  handleEvent (const uint16_t value) {}
};


//------------------------------------------------------------------------------------
//  Интерфейс источника сообщений
//------------------------------------------------------------------------------------
class ISubject{
  public:
    void  addObserver (IObserver* observer);
    void  removeObserver (IObserver* observer);

  private:
    void  notyfyObservers (void);
};
  
}; // namespace
#ifdef __cplusplus
};
#endif
#endif	//#ifndef
